function invalidNumber(input) {
    let isValid = Number(input[0]);

    if ((isValid >= 100 && isValid <= 200) || isValid === 0 ){
        
    } else {
        console.log("invalid");
    }

}

invalidNumber(["220"])

/*
Невалидно число 

Дадено число е валидно, ако е в диапазона [100…200] или е 0. Да се напише функция, която приема аргумент  цяло число, 
и печата "invalid" ако въведеното число не е валидно.  

Примерен вход и изход 

вход      изход       вход        изход            вход    изход              вход       изход 
(["75"]) invalid     (["150"]) (няма изход)     (["220"]) invalid          (["199"]) (няма изход) 

вход       изход       вход      изход            вход       изход          вход    изход 
(["-1"])  invalid    (["100"]) (няма изход)     (["200"]) (няма изход)     (["0"])(няма изход) 

*/