function numberInRange(input) {
    let num = Number(input[0]);

    if (num >= -100 && num <= 100 && num !== 0) {
        console.log("Yes");
    } else {
        console.log("No");
    }
}

numberInRange(["25"])

/*
Да се напише функция, която проверява дали въведеното от потребителя число е в интервала [-100, 100] и е различно от 0 и извежда "Yes", 
ако отговаря на условията, или "No" ако е извън тях. 

Примерен вход и изход 

  вход    изход    вход   изход     вход    изход 
(["-25"])  Yes    (["0"])  No     (["25"])   Yes 

*/