function trainingLab(input) {
    let w = Number(input[0]);
    let h = Number(input[1]);

    let wMetric = w * 100;
    let hMetric = h * 100 - 100;
    let desksInRow = parseInt(hMetric / 70);
    let rowsInWidht = parseInt(wMetric / 120);
    let seatsNumber = desksInRow * rowsInWidht - 3;

    console.log(seatsNumber);

}

trainingLab(["15", "8.9"])

/*
работно място - 70 на 120 cm 
маса - 70 на 40 cm
място за стол и преминаване с размер 70 на 80 cm 
Коридорът е широк поне 100 cm. 
    Изчислено е, че заради входната врата (която е с отвор 160 cm) се губи точно 1 работно място
    а заради катедрата (която е с размер 160 на 120 cm) се губят точно 2 работни места.

    Залата е широка 890 cm. От тях 100 cm отиват за коридора в средата. 
    В останалите 790 cm могат да се разположат по 11 бюра на ред (11 * 70 cm = 770 cm + 20 cm остатък). 
    Залата е дълга 1500 cm. В тях могат да бъдат разположени 12 реда (12 * 120 cm = 1440 + 60 cm остатък). 
    Брой места = 12 * 11 - 3 =  132 - 3 = 129 (имаме 12 реда по 11 места = 132 минус 3 места за катедра и входна врата). 
*/