function basketballEquipment(input) {
    let annualFee = Number(input[0]);
    
    let shoes = annualFee * 0.6;
    let team = shoes * 0.8;
    let ball = team * 0.25;
    let accessories = ball * (1/5);

    let costs = annualFee + shoes + team + ball + accessories;

    console.log(costs.toFixed(2));
}
basketballEquipment(["320"])

/*
Баскетболна екипировка 
320 = 1
 x  = 0.25
Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка. 
Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира, 
като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка: 

    Баскетболни кецове – цената им е 40% по-малка от таксата за една година 
    Баскетболен екип – цената му е 20% по-евтина от тази на кецовете 
    Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип 
    Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка 

Вход 
    От конзолата се четe 1 ред: 
    Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999] 

Изход 
    Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.
    Сумата да бъде форматирана до втория знак след десетичния знак. 

Примерен вход и изход 

Вход        320             550             230 

Изход       711.68          1223.20         511.52 

Обяснения   Цена на тренировките за година: 320 
            Цена на баскетболните кецове: 320 – 40% = 192 
            Цена на баскетболен екип: 192 – 20% = 153.6 
            Цена на баскетболна топка: 1 / 4 от 153.6 = 38.4 
            Цена на баскетболни аксесоари: 1 /  5 от 38.4 = 7.68 
            Обща цена за екипировката: 320 + 192 + 153.6 + 38.4 + 7.68 = 711.68      

 */