function cinema(input) {

    let projection = input[0];
    let rows = Number(input[1]);
    let columns = Number(input[2]);
    let totalRevenue = 0;

    if (projection == "Premiere") {
        totalRevenue = (rows * columns) * 12.00;
    } else if (projection == "Normal") {
        totalRevenue = (rows * columns) * 7.50;
    } else if (projection == "Discount") {
        totalRevenue = (rows * columns) * 5.00;
    }
    console.log(totalRevenue.toFixed(2));
}

cinema(["Premiere", "10", "12"])

/*
Кино 

В една кинозала столовете са наредени в правоъгълна форма в r реда и c колони. 
Има три вида прожекции с билети на различни цени: 

Premiere – премиерна прожекция, на цена 12.00 лева. 
Normal – стандартна прожекция, на цена 7.50 лева. 
Discount – прожекция за деца, ученици и студенти на намалена цена от 5.00 лева. 

Напишете функция, която приема тип прожекция (стринг), брой редове и брой колони в залата (цели числа) 
и изчислява общите приходи от билети при пълна зала. 
Резултатът да се отпечата във формат като в примерите по-долу, с 2 знака след десетичната точка.   

Примерен вход и изход 

            вход                    изход 

(["Premiere", "10", "12"])      1440.00 leva 
(["Normal", "21", "13"])        2047.50 leva 
(["Discount", "12", "30"])      1800.00 leva 

* Подсказка: използвайте прости проверки и елементарни изчисления. 
За да изведете резултата с точно 2 цифри след десетичната точка, използвайте toFixed(2) 

*/